{
    "name": "Lemon Ricotta Pancakes",
    "ingredients": [
        {
            "quantity": "1",
            "unit": "cup",
            "name": "ricotta cheese"
        },
        {
            "quantity": "1",
            "unit": "cup",
            "name": "all-purpose flour"
        },
        {
            "quantity": "2",
            "unit": "tablespoons",
            "name": "sugar"
        },
        {
            "quantity": "1",
            "unit": "teaspoon",
            "name": "baking powder"
        },
        {
            "quantity": "0.5",
            "unit": "teaspoon",
            "name": "baking soda"
        },
        {
            "quantity": "0.25",
            "unit": "teaspoon",
            "name": "salt"
        },
        {
            "quantity": "0.5",
            "unit": "cup",
            "name": "milk"
        },
        {
            "quantity": "2",
            "unit": "each",
            "name": "large eggs"
        },
        {
            "quantity": "1",
            "unit": "tablespoon",
            "name": "lemon zest"
        },
        {
            "quantity": "1",
            "unit": "teaspoon",
            "name": "vanilla extract"
        },
        {
            "quantity": "2",
            "unit": "tablespoons",
            "name": "lemon juice"
        }
    ],
    "instructions": [
        "In a large bowl, combine flour, sugar, baking powder, baking soda, and salt.",
        "In another bowl, whisk together ricotta cheese, milk, eggs, lemon zest, vanilla extract, and lemon juice until smooth.",
        "Slowly add the wet ingredients to the dry ingredients, mixing gently until just combined. Do not overmix.",
        "Heat a non-stick griddle or skillet over medium heat. Lightly grease with cooking spray or a small amount of butter.",
        "Pour 1/4 cup of batter onto the griddle for each pancake.",
        "Cook until bubbles form on the surface and the edges look set, about 2-3 minutes. Flip and cook until the other side is golden brown, about another 2 minutes.",
        "Serve the pancakes warm with your favorite toppings, such as fresh berries or a drizzle of honey."
    ],
    "nutrition_ratio": {
        "fat": 20,
        "carbs": 40,
        "protein": 15
    },
    "description": "Fluffy lemon ricotta pancakes with a hint of citrus flavor, perfect for a special breakfast or brunch. High in protein to support muscle repair and packed with delicious, nutrient-dense ingredients.",
    "cooking_time": "20 minutes",
    "serving_size": "4 servings",
    "additional_notes": "For a gluten-free option, substitute all-purpose flour with your favorite gluten-free flour blend. You can also add a handful of blueberries to the batter for extra flavor and nutrients."
}